<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 提示等級（Alert Levels）
    |--------------------------------------------------------------------------
    |
    | 這些是預設的提示等級，可以像函式一樣呼叫
    | AlertsMessageBag 類別上的對應方法，方便新增
    | 特定類型的訊息。
    |
    | 例如：
    |
    |     Alerts::info($message);
    |
    */

    'levels' => [
        'info',
        'warning',
        'danger',
        'success',
    ],

    /*
    |--------------------------------------------------------------------------
    | Session 鍵值
    |--------------------------------------------------------------------------
    |
    | 用來將快閃訊息（flashed messages）儲存到目前 session 中
    | 所使用的 session 鍵值。若與其他鍵值衝突，可以變更此設定。
    |
    */

    'session_key' => 'alert_messages',
];
