<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 額外要編譯的類別
    |--------------------------------------------------------------------------
    |
    | 你可以在這裡指定額外的類別，讓它們被包含進 `artisan optimize`
    | 指令產生的編譯檔案中。這些通常應該是幾乎每一個請求
    | 都會用到的類別。
    |
    */

    'files' => [
    ],

    /*
    |--------------------------------------------------------------------------
    | 編譯檔案的服務提供者
    |--------------------------------------------------------------------------
    |
    | 你可以在這裡列出定義了「compiles」函式的服務提供者，
    | 該函式會回傳需要額外編譯的檔案，方便你從所使用的
    | 套件中取得常用檔案。
    |
    */

    'providers' => [
    ],
];
