<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 預設序列化器
    |--------------------------------------------------------------------------
    |
    | 執行資料轉換時所使用的預設序列化器。可以留空以使用 Fractal
    | 內建的預設序列化器。這個值可以是字串，也可以是
    | League\Fractal\Serializer\SerializerAbstract 的子類別。
    |
    */

    'default_serializer' => League\Fractal\Serializer\JsonApiSerializer::class,

    /*
    |--------------------------------------------------------------------------
    | 自動引入（Auto Includes）
    |--------------------------------------------------------------------------
    |
    | 若啟用，Fractal 會自動加入名稱出現在 `include` 請求參數中的引入項目。
    |
    */

    'auto_includes' => [
        'enabled' => true,
        'request_key' => 'include',
    ],
];
