<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 預設雜湊演算法驅動
    |--------------------------------------------------------------------------
    |
    | 此選項控制應用程式用來對密碼進行雜湊運算的預設驅動。
    | 預設使用 bcrypt 演算法；不過你仍可以自由修改此選項。
    |
    | 支援的選項："bcrypt"、"argon"、"argon2id"
    |
    */

    'driver' => 'bcrypt',

    /*
    |--------------------------------------------------------------------------
    | Bcrypt 選項
    |--------------------------------------------------------------------------
    |
    | 你可以在這裡指定使用 Bcrypt 演算法對密碼進行雜湊運算時
    | 所使用的組態設定選項，用來控制對指定密碼進行雜湊運算
    | 所需的時間。
    |
    */

    'bcrypt' => [
        'rounds' => env('BCRYPT_ROUNDS', 10),
    ],

    /*
    |--------------------------------------------------------------------------
    | Argon 選項
    |--------------------------------------------------------------------------
    |
    | 你可以在這裡指定使用 Argon 演算法對密碼進行雜湊運算時
    | 所使用的組態設定選項，用來控制對指定密碼進行雜湊運算
    | 所需的時間。
    |
    */

    'argon' => [
        'memory' => 65536,
        'threads' => 1,
        'time' => 4,
    ],
];
