<?php

use Illuminate\Support\Str;

return [
    /*
    |--------------------------------------------------------------------------
    | 預設 Session 驅動
    |--------------------------------------------------------------------------
    |
    | 此選項決定用來處理傳入請求的預設 session 驅動。
    | Laravel 支援多種儲存方式來保存 session 資料。
    | 資料庫儲存是很不錯的預設選擇。
    |
    | 支援的選項："file"、"cookie"、"database"、"apc"、
    |             "memcached"、"redis"、"dynamodb"、"array"
    |
    */

    'driver' => env('SESSION_DRIVER', 'redis'),

    /*
    |--------------------------------------------------------------------------
    | Session 存續時間
    |--------------------------------------------------------------------------
    |
    | 你可以在這裡指定 session 在過期前允許閒置的分鐘數。
    | 若你希望瀏覽器關閉時 session 立即過期，
    | 可以透過 expire_on_close 這個設定選項來指定。
    |
    */

    'lifetime' => env('SESSION_LIFETIME', 720),

    'expire_on_close' => env('SESSION_EXPIRE_ON_CLOSE', false),

    /*
    |--------------------------------------------------------------------------
    | Session 加密
    |--------------------------------------------------------------------------
    |
    | 此選項讓你可以輕鬆指定所有的 session 資料在儲存前都應該先加密。
    | 所有加密作業都由 Laravel 自動完成，
    | 你依然可以像平常一樣正常使用 session。
    |
    */

    'encrypt' => env('SESSION_ENCRYPT', true),

    /*
    |--------------------------------------------------------------------------
    | Session 檔案位置
    |--------------------------------------------------------------------------
    |
    | 使用「file」session 驅動時，session 檔案會被存放在磁碟上。
    | 這裡定義了預設的儲存位置；不過你也可以自由
    | 指定其他要儲存的位置。
    |
    */

    'files' => storage_path('framework/sessions'),

    /*
    |--------------------------------------------------------------------------
    | Session 資料庫連線
    |--------------------------------------------------------------------------
    |
    | 使用「database」或「redis」session 驅動時，你可以指定
    | 用來管理這些 session 的連線，這應該要對應到
    | 你資料庫組態設定選項中的其中一組連線。
    |
    */

    'connection' => env('SESSION_CONNECTION'),

    /*
    |--------------------------------------------------------------------------
    | Session 資料庫資料表
    |--------------------------------------------------------------------------
    |
    | 使用「database」session 驅動時，你可以指定用來儲存 session 的資料表。
    | 當然，這裡已經為你定義好一個合理的預設值；
    | 不過你也可以自由改成其他資料表。
    |
    */

    'table' => env('SESSION_TABLE', 'sessions'),

    /*
    |--------------------------------------------------------------------------
    | Session 快取儲存區
    |--------------------------------------------------------------------------
    |
    | 使用框架中以快取為基礎的 session 後端時，你可以定義
    | 用來在不同請求之間儲存 session 資料的快取儲存區。
    | 這個值必須符合你所定義的其中一個快取儲存區。
    |
    | 影響範圍："apc"、"dynamodb"、"memcached"、"redis"
    |
    */

    'store' => env('SESSION_STORE'),

    /*
    |--------------------------------------------------------------------------
    | Session 清理抽籤機制
    |--------------------------------------------------------------------------
    |
    | 部分 session 驅動必須手動清理其儲存位置，
    | 以清除儲存空間中的舊 session。這裡設定的是
    | 每次請求觸發清理的機率，預設為百分之二（2/100）。
    |
    */

    'lottery' => [2, 100],

    /*
    |--------------------------------------------------------------------------
    | Session Cookie 名稱
    |--------------------------------------------------------------------------
    |
    | 你可以在這裡變更框架建立的 session cookie 名稱。
    | 通常你不需要變更這個值，因為這麼做
    | 並不會帶來實質上的安全性提升。
    |
    */

    'cookie' => env(
        'SESSION_COOKIE',
        Str::slug(env('APP_NAME', 'pterodactyl'), '_') . '_session'
    ),

    /*
    |--------------------------------------------------------------------------
    | Session Cookie 路徑
    |--------------------------------------------------------------------------
    |
    | Session cookie 路徑決定了 cookie 在哪些路徑下會被視為可用。
    | 通常這會是應用程式的根路徑，
    | 但你可以視需要自由變更此設定。
    |
    */

    'path' => env('SESSION_PATH', '/'),

    /*
    |--------------------------------------------------------------------------
    | Session Cookie 網域
    |--------------------------------------------------------------------------
    |
    | 此值決定 session cookie 在哪些網域與子網域下可用。
    | 預設情況下，cookie 會在根網域與所有子網域下都可使用。
    | 通常不需要變更此設定。
    |
    */

    'domain' => env('SESSION_DOMAIN'),

    /*
    |--------------------------------------------------------------------------
    | 僅限 HTTPS 的 Cookie
    |--------------------------------------------------------------------------
    |
    | 將此選項設為 true 後，只有在瀏覽器使用 HTTPS 連線時，
    | session cookie 才會被傳送回伺服器。這能避免 cookie
    | 在無法安全傳輸的情況下被送出。
    |
    */

    'secure' => env('SESSION_SECURE_COOKIE'),

    /*
    |--------------------------------------------------------------------------
    | 僅限 HTTP 存取
    |--------------------------------------------------------------------------
    |
    | 將此值設為 true 可防止 JavaScript 存取 cookie 的值，
    | 該 cookie 就只能透過 HTTP 協定存取。
    | 你應該不太可能需要停用這個選項。
    |
    */

    'http_only' => env('SESSION_HTTP_ONLY', true),

    /*
    |--------------------------------------------------------------------------
    | Same-Site Cookie
    |--------------------------------------------------------------------------
    |
    | 此選項決定當發生跨網站請求時 cookie 的行為方式，
    | 可用來緩解 CSRF 攻擊。預設情況下，
    | 我們會將此值設為「lax」以允許安全的跨網站請求。
    |
    | 參見：https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie#samesitesamesite-value
    |
    | 支援的選項："lax"、"strict"、"none"、null
    |
    */

    'same_site' => env('SESSION_SAME_SITE', 'lax'),

    /*
    |--------------------------------------------------------------------------
    | 分割 Cookie（Partitioned Cookies）
    |--------------------------------------------------------------------------
    |
    | 將此值設為 true 會讓 cookie 在跨網站情境下
    | 綁定至最上層網站。當 cookie 被標記為「secure」
    | 且 Same-Site 屬性設為「none」時，瀏覽器就會接受分割 cookie。
    |
    */

    'partitioned' => env('SESSION_PARTITIONED_COOKIE', false),
];
