<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 樣板儲存路徑
    |--------------------------------------------------------------------------
    |
    | 大部分的樣板系統都是從磁碟載入樣板檔案。你可以在這裡指定
    | 一組要檢查樣板檔案的路徑陣列。當然，Laravel 常用的
    | 樣板路徑已經預先為你註冊好了。
    |
    */

    'paths' => [
        resource_path('views'),
    ],

    /*
    |--------------------------------------------------------------------------
    | 編譯後的樣板路徑
    |--------------------------------------------------------------------------
    |
    | 此選項決定應用程式所有編譯後的 Blade 樣板要存放在哪裡。
    | 通常會放在 storage 目錄底下，不過你還是可以照常
    | 自由變更這個值。
    |
    */

    'compiled' => env(
        'VIEW_COMPILED_PATH',
        realpath(storage_path('framework/views'))
    ),
];
