<?php

return [
    'email' => [
        'title' => '更新你的電子郵件',
        'updated' => '你的電子郵件地址已更新。',
    ],
    'password' => [
        'title' => '變更你的密碼',
        'requirements' => '新密碼長度至少須為 8 個字元。',
        'updated' => '你的密碼已更新。',
    ],
    'two_factor' => [
        'button' => '設定雙重驗證',
        'disabled' => '此帳號的雙重驗證已停用。登入時將不再需要提供驗證碼。',
        'enabled' => '此帳號的雙重驗證已啟用！從現在起，登入時你將需要提供裝置產生的驗證碼。',
        'invalid' => '提供的驗證碼無效。',
        'setup' => [
            'title' => '設定雙重驗證',
            'help' => '無法掃描條碼嗎？請在你的應用程式中輸入以下代碼：',
            'field' => '輸入驗證碼',
        ],
        'disable' => [
            'title' => '停用雙重驗證',
            'field' => '輸入驗證碼',
        ],
    ],
];
